chore: update the docs
